# Задача: используя цикл запрашивайте у пользователя число пока оно не станет больше 0, но меньше 10.# После того, как пользователь введет корректное число, возведите его в степерь 2 и выведите на экран.# Например, пользователь вводит число 123, вы сообщаете ему, что число не верное,# и сообщаете об диапазоне допустимых. И просите ввести заного.# Допустим пользователь ввел 2, оно подходит, возводим в степень 2, и выводим 4while True:    user_number = int(input('Введите число: '))    if user_number > 0 and user_number < 10        break    print('Введенное число неверное. Допустимый диапазон: 0<X<10')print('Ваш результат в степени 2: ', user_number ** 2)# Задача-2: Исходные значения двух переменных запросить у пользователя.# Поменять значения переменных местами. Вывести новые значения на экран.# Решите задачу, используя только две переменные.# Подсказки:# * постарайтесь сделать решение через действия над числами;a = int(input('Введите число а: '))b = int(input('Введите число b: '))a = a + bb = a - ba = a - bprint('new a: ', a, ' new b: ', b)